# IsValidValue Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetPropertyString..::..IsValidValue Method
AssetPropertyString Class See Also
---
Checks that the value is a valid value for this property.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public bool IsValidValue(
	string value
)
```

Visual Basic
---
```text
Public Function IsValidValue ( _
	value As String _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidValue(
	String^ value
)
```

# ### Parameters
value
    Type: System..::..String The value to be checked.
# ### Return Value
True if the value is valid for the property.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Cannot check validity for a property not being edited in AppearanceAssetEditScope. |

# See Also
AssetPropertyString Class
Autodesk.Revit.DB.Visual Namespace